import css from './Bonus.module.css';

export default function Bonus () {

  return (
    <div className={css.containerBonus}>
    <h1>Поклич друзів разом опановувати українську та отримувати бонуси на 8 рівнів!</h1>
    <h2>Бонусна багаторівнева програма руху “Єдині” “Плюсуй українську”</h2>
    <h3>Основні положення</h3>
    <p>Бонусна програма “Плюсуй українську” спрямована на розширення спільноти свідомих людей, які переходять або вдосконалюють українську мову за підтримки проєкту “Єдині”.</p>
    <p>Бонусна програма “Плюсуй українську” - це програма заохочення учасників мовних курсів проєкту “Єдині” рекомендувати дані курси своєму оточенню.</p>
    <p>Участь у бонусній програмі можуть брати користувачі, які зареєстровані на сайті проєкту “Єдині” та підтвердили свої дані (email та телефон).</p>
    <p>Кожен користувач сайту “Єдині” має свого запрошувача, людину, завдяки кому дізнався про проєкт та зареєструвався за його запрошувальним покликанням.</p>
    <p>Якщо учасник зареєструвався без запрошувального покликання, його консультує адміністратор проєкту.</p>
    <p>Таким чином, будується багаторівневе дерево структури учасників бонусної програми.</p>
    <p>У особистому кабінеті кожен учасник має власний бонусний рахунок та персональне покликання для запрошень разом з інструментами для запрошень.</p>
    <p>За їх допомогою учасник може поділитися зі своїм оточенням інформацією про проєкт будь яким зручним способом.</p>
    <p>Повна статистика, включно зі структурою запрошених учасників, історією внесків підтримки та бонусів, також доступна у особистому кабінеті учасника.</p>
    <h3>Як формуються бонуси?</h3>
    <p>Учасники добровільно підтримують проєкт внесками. Сума допомоги кратна <span className={css.num}>40</span> гривням.</p>
    <p>Кожні <span className={css.num}>40 гривень</span> підтримки дозволяють проєкту допомогти одному українцеві на місяць опанувати українську мову.</p>
    <p>При цьому проєкт винагороджує активних учасників програми “Плюсуй українську” за допомогу у поширенні інформації про діяльність руху “Єдині”.</p>
    <p>Бонуси нараховуються на бонусний рахунок учасника із внесків підтримки, які роблять учасники його структури на <span className={css.num}>8 рівнях</span>, згідно бонусної програми, описаної нижче (див. таб).</p>
    <p>Бонуси нараховуються учаснику за умови, якщо поточне значення його особистого рівня підтримки проєкту більше або дорівнює <span className={css.num}>1</span>.</p>
    <p>Особистий рівень підтримки показує скільки українців на місяць в середньому опанували українську завдяки внескам даного учасника з початку його участі у бонусній програмі.</p>
    <p>Актуальне значення особистого рівня підтримки розраховується автоматично та відображається у кабінеті учасника.</p>
    <p>Бонуси з бонусного рахунку можна використовувати для підтримки проєкту та/або виводити на власну банківську карту.</p>
    <h3>Приклад отримання бонусів у програмі  “Плюсуй українську”</h3>
    <p>Припустимо, що в учасника ‘A’ на першому рівні є <span className={css.num}>5 учасників</span>, які приєдналися за його запрошенням. У кожного з них є також по 5 учасників.</p>
    <p>Таким чином, на 2-му рівні в учасника ‘A’ вже <span className={css.num}>5 * 5 = 25</span> учасників. У кожного з них є також по 5 учасників.</p>
    <p>Таким чином, на 3-му рівні в учасника ‘A’ вже <span className={css.num}>5 * 25 = 125</span> учасників. У кожного з них є також по 5 учасників. І так далі…</p>
    <p>Таким чином, в структурі учасника ‘A’ на 8-ми рівнях буде <span className={css.num}>488 280</span> учасників.</p>
    <p>Припустимо, що кожен учасник щомісяця робить мінімальний внесок підтримки проєкту у розмірі <span className={css.num}>40 гривень</span>. В таблиці нижче наведено розрахунки за таких умов.</p>
    <p></p>
    <p>У даному прикладі ми розглянули ідеальну картину, коли учасник ‘A’ та кожен учасник його структури має по <span className={css.num}>5</span> партнерів, які щомісяця перераховують добровільний внесок у розмірі <span className={css.num}>40</span> гривень на підтримку проєкту. Загальна сума бонусів учасника ‘A’ при цьому складає майже <span className={css.num}>1 мільйон</span> гривень на місяць.</p>
    <p>Звучить аж надто оптимістично? Не лякайтесь <span className={css.num}>:)</span> Вам не доведеться особисто вести на курс тисячі людей. Достатньо буде запросити лише декількох людей зі свого оточення. А далі працює закон геометричної прогресії.</p>
    <p>Давайте подивимось, яким буде Ваш результат, коли в реальності Ви реалізуєте наведений приклад хоча б на <span className={css.num}>5%</span>. У такому випадку Ваша структура нараховуватиме приблизно <span className={css.num}>25 000</span> партнерів.</p>
    <p>Проєкт при цьому матиме змогу допомогти опанувати українську мову майже <span className={css.num}>25 000</span> українцям, а сума Вашого бонусу складатиме приблизно <span className={css.num}>50 000</span> гривень на місяць.</p>
    <p>Отже, допомагати поширювати українську мову з бонусною програмою проєкту “Єдині” надзвичайно вигідно!</p>
    <p>Продовжуйте плюсувати українську - зміцнюйте наш культурний фронт та отримуйте чудові бонуси!</p>
    <button type="button" className={css.button}>
        Приєднатися до бонусної програми
    </button>
  </div>
  );
};