export default function Bonus() {
    return (
      <div>
        <h1>Поклич друзів разом опановувати українську та отримувати бонуси на 8 рівнів!</h1>
        <h2>Бонусна багаторівнева програма руху “Єдині” “Плюсуй українську”</h2>
        <h3>Основні положення</h3>
        <p>Бонусна програма “Плюсуй українську” спрямована на розширення спільноти свідомих людей, які переходять або вдосконалюють українську мову за підтримки проєкту “Єдині”.</p>
        <p>Бонусна програма “Плюсуй українську” - це програма заохочення учасників мовних курсів проєкту “Єдині” рекомендувати дані курси своєму оточенню.</p>
        <p>Участь у бонусній програмі можуть брати користувачі, які зареєстровані на сайті проєкту “Єдині” та підтвердили свої дані (email та телефон).</p>
        <p>Кожен користувач сайту “Єдині” має свого запрошувача, людину, завдяки кому дізнався про проєкт та зареєструвався за його запрошувальним покликанням.</p>
        <p>Якщо учасник зареєструвався без запрошувального покликання, його консультує адміністратор проєкту.</p>
        <p>Таким чином, будується багаторівневе дерево структури учасників бонусної програми.</p>
        <p>У особистому кабінеті кожен учасник має власний бонусний рахунок та персональне покликання для запрошень разом з інструментами для запрошень.</p>
        <p>За їх допомогою учасник може поділитися зі своїм оточенням інформацією про проєкт будь яким зручним способом.</p>
        <p>Повна статистика, включно зі структурою запрошених учасників, історією внесків підтримки та бонусів, також доступна у особистому кабінеті учасника.</p>
        <h3>Як формуються бонуси?</h3>
        <p>Учасники добровільно підтримують проєкт внесками. Сума допомоги кратна 40.</p>
        <p>Кожні 40 грн підтримки дозволяють проєкту допомогти одному українцеві на місяць опанувати українську мову.</p>
        <p>При цьому проєкт винагороджує активних учасників програми “Плюсуй українську” за допомогу у поширенні інформації про діяльність руху “Єдині”.</p>
        <p>Бонуси нараховуються на бонусний рахунок учасника з внесків підтримки, які роблять учасники його структури на 8 рівнях, згідно бонусної програми, описаної нижче (див. таб).</p>
        <p>Бонуси нараховуються учаснику, у якого поточне значення персонального рівня підтримки проєкту більше або дорівнює 1.</p>
        <p>Персональний рівень підтримки показує скільки українців на місяць в середньому опанували українську завдяки внескам даного учасника з початку його участі у бонусній програмі.</p>
        <p>Персональний рівень підтримки - динамічний показник, значення якого розраховується автоматично на поточний момент часу та виводиться у особистому кабінеті учасника.</p>
        <p>Бонуси з бонусного рахунку можна використовувати для підтримки проєкту та виводити на власну банківську карту.</p>
        <p></p>
        <p></p>
        <p></p>
      </div>
    );
  };