import css from './Tools.module.css';

export default function Tools() {
    return (
      <div className={css.containerBonus}>
    <h1>Поклич друзів разом опановувати українську та отримувати бонуси на 8 рівнів!</h1>
    <h3>Приклад отримання бонусів у програмі  “Плюсуй українську”</h3>
    <p>Припустимо, що в учасника ‘A’ на першому рівні є <span className={css.num}>5 учасників</span>, які приєдналися за його запрошенням. У кожного з них є також по 5 учасників.</p>
    <p>Таким чином, на 2-му рівні в учасника ‘A’ вже <span className={css.num}>5 * 5 = 25</span> учасників. У кожного з них є також по 5 учасників.</p>
    <p>Таким чином, на 3-му рівні в учасника ‘A’ вже <span className={css.num}>5 * 25 = 125</span> учасників. У кожного з них є також по 5 учасників. І так далі…</p>
    <p>Таким чином, в структурі учасника ‘A’ на 8-ми рівнях буде <span className={css.num}>488 280</span> учасників.</p>
    <p>Припустимо, що кожен учасник щомісяця робить мінімальний внесок підтримки проєкту у розмірі <span className={css.num}>40 гривень</span>. В таблиці нижче наведено розрахунки за таких умов.</p>
    <p></p>
    <p>У даному прикладі ми розглянули ідеальну картину, коли учасник ‘A’ та кожен учасник його структури має по <span className={css.num}>5</span> партнерів, які щомісяця перераховують добровільний внесок у розмірі <span className={css.num}>40</span> гривень на підтримку проєкту. Загальна сума бонусів учасника ‘A’ при цьому складає майже <span className={css.num}>1 мільйон</span> гривень на місяць.</p>
    <p>Звучить аж надто оптимістично? Не лякайтесь <span className={css.num}>:)</span> Вам не доведеться особисто вести на курс тисячі людей. Достатньо буде запросити лише декількох людей зі свого оточення. А далі працює закон геометричної прогресії.</p>
    <p>Давайте подивимось, яким буде Ваш результат, коли в реальності Ви реалізуєте наведений приклад хоча б на <span className={css.num}>5%</span>. У такому випадку Ваша структура нараховуватиме приблизно <span className={css.num}>25 000</span> партнерів.</p>
    <p>Проєкт при цьому матиме змогу допомогти опанувати українську мову майже <span className={css.num}>25 000</span> українцям, а сума Вашого бонусу складатиме приблизно <span className={css.num}>50 000</span> гривень на місяць.</p>
    <p>Отже, допомагати поширювати українську мову з бонусною програмою проєкту “Єдині” надзвичайно вигідно!</p>
    <p>Плюсуйте українську - зміцнюйте наш культурний фронт та отримуйте чудові бонуси!</p>
  </div>
    );
  };