import { BASE_CLIENT_URL } from '../../constants';
import { useAuth } from 'hooks';
import css from './Tools.module.css';

export default function Tools() {
  const {user} = useAuth();

    return (
      <div className={css.containerBonus}>
    <h1>Поклич друзів разом опановувати українську та отримувати бонуси на 8 рівнів!</h1>
    <h2>Запрошувальне посилання</h2>
    <p>{`${BASE_CLIENT_URL}?x=${user.id}`}</p>
    <h3>Приклад отримання бонусів у програмі  “Плюсуй українську”</h3>
    <p>Розглянемо, коли у Вашій команді на першому рівні є <span className={css.num}>3</span> учасники, які приєдналися за Вашим запрошенням. У кожного з них є також по 3 учасники в команді.</p>
    <p>На 2-му рівні у Вас’ вже <span className={css.num}>3 * 3 = 9</span> учасників. У кожного з них є також по 3 учасники.</p>
    <p>На 3-му рівні у Вас вже <span className={css.num}>9 * 3 = 27</span> учасників. У кожного з них є також по 3 учасники. І так далі…</p>
    <p>Коли кожен учасник, наприклад, щомісяця робить базовий внесок підтримки у розмірі 40 гривень, Ви отримуєте відповідну подяку від проєкту <span className={css.num}>:)</span></p>
    <p>В таблиці наведено розрахунки Ваших бонусів.</p>
    <p></p>
    <p>Як бачимо, у Вашій структурі на 8-ми рівнях майже <span className={css.num}>10 000</span> партнерів.</p>
    <p>Проєкт при цьому має змогу допомогти опанувати українську мову майже <span className={css.num}>10 000</span> українцям, а загальна сума Вашого бонусу складає біля <span className={css.num}>20 000</span> гривень на місяць.</p>
    <p>Вам достатньо порекомендувати наш безоплатний курс лише кільком людям зі свого оточення. А далі працює закон геометричної прогресії.</p>
    <p>Причому у даній програмі Ви не маєте ніяких обмежень. Уявіть, а краще розрахуйте, як зросте Ваш результат, коли у кожного партнера Вашої структури буде, наприклад, не по 3, а по 5 учасників. Ви будете приємно здивовані <span className={css.num}>:)</span></p>
    <p>Отже, допомагати поширювати українську мову з проєктом “Єдині” надзвичайно цікаво та вигідно!</p>
    <p>Запрошуйте друзів, разом плюсуйте українську, зміцнюйте наш культурний фронт та отримуйте чудові бонуси!</p>
  </div>
    );
  };